//-----------------------------------------------------------------
// 程序描述:
//     AD7606串行测试实验
// 作    者: 凌智电子
// 开始日期: 2020-11-11
// 完成日期: 2020-11-11
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0:  AD7606串行测试实验
// 调试工具: 凌智STM32H750核心板、LZE_ST_LINK2、4.3寸/2.8寸 TFT液晶屏
// 说    明: 
// 硬件连接：
//							AD7606模块							STM32H750核心板
//								+5V				 ------->				+5V
//								GND				 ------->				GND
// 								OSI0 			 -------> 			PC0
// 								OSI1 			 -------> 			PC1
// 								OSI2 			 -------> 			PC2
// 								SER 			 -------> 			PC3
// 								STBY 			 -------> 			PC4
// 								C0-A 			 -------> 			PC5
// 								C0-B 			 -------> 			PC6
// 								REST 			 -------> 			PC7
// 								BUSY 			 -------> 			PA0
// 								FR-D 			 -------> 			PA1
// 								CS_N 			 -------> 			PB12
// 								RD/SC 	 	 -------> 			PB13
// 						  	DB7    		 -------> 			PB14
// 						  	DB15    	 -------> 			PB15
//					剩余的DB引脚不接
// 注意：
//				(1) 通过J3跳帽选择输入电压的范围，修改程序第82行和第87行中的sprintf里面的(float)(DB_data[i]*5000.0/32768)的5000.0，在5000.0和10000.0根据跳帽改变。
//				(2) J2跳帽这里连接3.3V，具体选择看引脚功能。
//    
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 头文件包含
//-----------------------------------------------------------------
#include "system.h"
#include "delay.h"
#include "usart.h"
#include "lcd.h"
#include "led.h"
#include "AD7606.h"
//-----------------------------------------------------------------

//-----------------------------------------------------------------
// 主程序
//-----------------------------------------------------------------
int main(void)
{
	uint8_t i;
	uint8_t dis_buf[40];
	s16 DB_data[8] = {0};
	
	CPU_CACHE_Enable();			// 启用CPU缓存
  HAL_Init();          		// 初始化HAL库
	MPU_Memory_Protection();// 设置保护区域
	SystemClock_Config(); 	// 设置系统时钟,400Mhz  
	SysTick_clkconfig(400);	// SysTick参数配置
	LED_Init();           	// 初始化LED
	uart_init(115200);			// 初始化串口
	LCD_Init();           	// 初始化LCD
	AD7606_Init();					// 初始化AD7606
	POINT_COLOR=BLACK; 				// 笔画颜色
	LCD_ShowString(10,10,200,16,16,"STM32 AD7606 Channels Test:");
	POINT_COLOR=RED; 				// 笔画颜色
	while(1)
	{
		AD7606_StartConvst();
		AD7606_Delay(1);
	  while((BUSY == GPIO_PIN_SET))	// 读取BUSY的状态，为低电平表示电平转换结束，可以读取数据
		{
			AD7606_Delay(10);
		}
		
		AD7606_ReadData(DB_data); 		//读取数据放至数组DB_data[]
		for(i=0;i<8;i++)
		{
			sprintf((char*)dis_buf,"CH%1d:%8.1f mv  0x%04x %6d", i+1, (float)(DB_data[i]*10000.0/32768), (uint16_t)(DB_data[i]^0x8000), (uint16_t)(DB_data[i]^0x8000));
			LCD_ShowString(10, 60+(i)*20, 200, 16, 16, (char *)dis_buf);			//液晶显示
		}
		for(i=0;i<8;i++)
		{
			sprintf((char*)dis_buf,"CH%1d:%8.1f mv  0x%04x %6d\r\n", i+1, (float)(DB_data[i]*10000.0/32768), (uint16_t)(DB_data[i]^0x8000), (uint16_t)(DB_data[i]^0x8000));
			printf("%s",dis_buf);                  //在串口显示结果
			delay_ms(10);
		}	
		printf("\r\n");                  //在串口显示结果
		delay_ms(500);
		LED_R_Toggle;	 
	}									
}

//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
